Test/ToolOpenFoamErrorOpenCellsFoundCorrected/system/fvSchemes
FoamFile
{
  version  2.0;
  format   ascii;
  class    dictionary;
  location "system";
  object   fvSchemes;
}


ddtSchemes
{
  default Euler;
}

gradSchemes
{
  default Gauss linear;
}

divSchemes
{
  default none;
  div(phi,U) Gauss limitedLinearV 1;
  div(phi,e) Gauss limitedLinear 1;
  div(phid,p) Gauss limitedLinear 1;
  div(phi,K) Gauss limitedLinear 1;
  div(phiv,p) Gauss limitedLinear 1;
  div(phi,k) Gauss upwind;
  div(phi,epsilon) Gauss upwind;
  div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
  default Gauss linear corrected;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

fluxRequired
{
  default no;
  p;
}
